{
    "articles": [
        {
            "title": "Meta Connect 2025 LIVE — Ray-Ban Meta Display smart glasses, new Oakley glasses and all the news as it happens - Tom's Guide",
            "description": "Meta is preparing for a new era of smart glasses",
            "url": "https://www.tomsguide.com/news/live/meta-connect-2025-live-updates",
            "image": "https://cdn.mos.cms.futurecdn.net/KJZtQ2KBq6s3nHcqV8yhfA.jpg"
        },
        {
            "title": "The iPhone 17 is the one to get this year - The Verge",
            "description": "We test the iPhone 17 to see if its new features like an always-on display make it worth buying over the Air and Pro.",
            "url": "https://www.theverge.com/tech/779568/iphone-17-review-apple-best-features",
            "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/257946_iPhone_17_AKrales_0312.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200"
        },
        {
            "title": "All of the best iPhone 17 case deals: Exclusive discounts, launch bundles, and more [Updated] - 9to5Toys",
            "description": "The usual truckload of new iPhone 17 cases have arrived, and we have already rounded up many of our favorites with more to come. But this is the place to find all of the models that are already seeing price drops, be it exclusive deals we have secured for rea…",
            "url": "http://9to5toys.com/2025/09/16/all-best-iphone-17-case-deals/",
            "image": "https://i0.wp.com/9to5toys.com/wp-content/uploads/sites/5/2025/09/iPhone-17-case-deals-best.jpg?resize=1200%2C628&ssl=1"
        },
        {
            "title": "'My Advice to Users Is to Accept Reality and Tune, or to Not Play' — Randy Pitchford Is at the 'Get a Refund From Steam' Stage of the Borderlands 4 PC Performance Backlash - IGN",
            "description": "Randy Pitchford has continued his social media push to address complaints about the performance of the PC version of Borderlands 4, telling some disgruntled players they can get a Steam refund if they’re unhappy with the game.",
            "url": "https://www.ign.com/articles/my-advice-to-users-is-to-accept-reality-and-tune-or-to-not-play-randy-pitchford-is-at-the-get-a-refund-from-steam-stage-of-the-borderlands-4-pc-performance-backlash",
            "image": "https://assets-prd.ignimgs.com/2025/09/16/gettyimages-2165616825-1758023789142.jpg?width=1280&format=jpg&auto=webp&quality=80"
        },
        {
            "title": "AirPods Pro 3 Use Acoustic Seal Test for Optimizing Sound Quality and ANC - MacRumors",
            "description": "The AirPods Pro 3 use an Acoustic Seal Test to check the fit of ear tips, according to a new Apple support document. Apple says that the Acoustic...",
            "url": "https://www.macrumors.com/2025/09/16/airpods-pro-3-acoustic-seal-test/",
            "image": "https://images.macrumors.com/t/abAQ4U5Ck5avU2zapaEXVfrJ_x4=/2000x/article-new/2025/09/airpods-pro-3-tips.jpg"
        },
        {
            "title": "Dragon Quest VII Reimagined Producer Talks Story Restructure, Diorama Models, And New Content - Noisy Pixel",
            "description": "Square Enix shared a new interview with producer Takeshi Ichikawa on Dragon Quest VII Reimagined, detailing story restructuring, diorama-inspired visuals, cut subplots, and new quality-of-life features ahead of its 2026 launch.",
            "url": "https://noisypixel.net/dragon-quest-vii-reimagined-interview-story-diorama-content/",
            "image": "https://noisypixel.net/wp-content/uploads/2025/09/Dragon-Quest-VII-Reimagined-3.jpg"
        }
    ]
}