{
    "articles": [
        {
            "title": "Computex 2025 live — Nvidia goes big on AI, new laptops and more from the world's largest computing event - Tom's Guide",
            "description": "Join us, as we see the future of computing in Taiwan.",
            "url": "https://www.tomsguide.com/news/live/computex-2025",
            "image": "https://cdn.mos.cms.futurecdn.net/rWdtCuWmEDbrG3XnYWBbZQ.jpg"
        },
        {
            "title": "MSI unveils GeForce RTX 5090 SUPRIM TITANIUM EDITION - VideoCardz.com",
            "description": "MSI SUPRIM TITANIUM MSI has a new flagship GPU designed for the wealthiest gamers. TechPowerUP gained access to the Computex show floor, where new products are set to be revealed tomorrow (Computex starts on May 20). We’re already used to TPU’s stealthy metho…",
            "url": "https://videocardz.com/newz/msi-unveils-geforce-rtx-5090-suprim-titanium-edition",
            "image": "https://cdn.videocardz.com/1/2025/05/MSI-TITANIUM-RTX5090-SUPRIM-1.jpg"
        },
        {
            "title": "Nintendo Renews A Couple Of Metroid Prime Trademarks - Nintendo Life",
            "description": "But don't get your hopes up",
            "url": "https://www.nintendolife.com/news/2025/05/nintendo-renews-a-couple-of-metroid-prime-trademarks",
            "image": "https://images.nintendolife.com/0bbf018762924/large.jpg"
        },
        {
            "title": "Intel Announces Arc Pro B-Series, \"Project Battlematrix\" Linux Software Improvements - Phoronix",
            "description": "Intel is using Computex 2025 to showcase their new Arc Pro B-Series graphics cards that will be available in Q3 for professional use-cases as well as focusing on AI inference workstations and edge computing workloads.",
            "url": "https://www.phoronix.com/review/intel-arc-pro-b-series",
            "image": "https://www.phoronix.net/image.php?id=intel-arc-pro-b-series&image=intel_arc_pro_b_7"
        },
        {
            "title": "ASUS Showcases World’s First 610Hz Gaming Monitor: ROG STRIX ACE XG248Q5G Packed With Blazing Fast Super TN Panel - Wccftech",
            "description": "ASUS has unveiled the world's fastest and the first 610Hz gaming monitor: the ROG STRIX ACE XG248Q5G, which boasts a Super TN panel.",
            "url": "https://wccftech.com/asus-rog-strix-ace-xg248q5g-610hz-monitor/",
            "image": "https://cdn.wccftech.com/wp-content/uploads/2025/05/ASUS-STRIX-XG248Q5G-Featured.png"
        },
        {
            "title": "GeForce RTX 5060 debuts for desktops and laptops, but proper reviews need to wait - VideoCardz.com",
            "description": "NVIDIA launches GeForce RTX 5060 at $299 As planned, NVIDIA is launching its entry-level RTX 5060 desktop GPU today, along with a version for laptops. These are the lowest SKUs in the RTX 50 “Blackwell” family and are intended for budget gaming systems. This …",
            "url": "https://videocardz.com/newz/geforce-rtx-5060-debuts-for-desktops-and-laptops-but-proper-reviews-need-to-wait",
            "image": "https://cdn.videocardz.com/1/2025/05/RTX5060-HERO.jpg"
        }
    ]
}